HrMitra/app/views/employees/_document.html.erb

<% if employee.documents.present? %>
---
SELECT "documents".* FROM "documents" WHERE "documents"."employee_id" = ?  [["employee_id", 1]]