HrMitra/app/views/employees/show.html.erb

SELECT "documents".* FROM "documents" WHERE "documents"."employee_id" = ?  [["employee_id", 1]]
---
                    <p class="lead"><strong>Pin Code: </strong><%= @employee.pincode %></p>
                    <p class="lead"><strong>Documents: </strong><%= @employee.documents.length %></p>