HrMitra/app/controllers/documents_controller.rb

    def index
        @documents = Document.all
---
SELECT "documents".* FROM "documents"

    def create
        @document = Document.new(document_params)
        if @document.save
---
INSERT INTO "documents" ("name", "doc_type", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "10th Marksheet"], ["doc_type", "Marksheet"], ["employee_id", 1], ["created_at", "2023-03-07 12:33:33.044087"], ["updated_at", "2023-03-07 12:33:33.044087"]]

    def update
        if @document.update(document_params)
---
UPDATE "documents" SET "updated_at" = ? WHERE "documents"."id" = ?  [["updated_at", "2023-03-07 12:33:33.063391"], ["id", 1]]

        def set_document
            @document = Document.find(params[:id])
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]