HrMitra/app/controllers/employees_controller.rb

    def create
        # @employee = Employee.new(first_name: params[:employee][:first_name])
        @employee = Employee.new(employee_params)
        if @employee.save
---
INSERT INTO "employees" ("first_name", "middle_name", "last_name", "email", "city", "state", "country", "pincode", "address", "created_at", "updated_at", "dob", "age") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def document
        @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]